// Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
int [] array = {1, 2, 5, 7, 19, 6, 1, 33};
array [0] = 8;

Array.ForEach(array,Console.WriteLine);
